org/20220419104330-globalization.org
:PROPERTIES:
:ID:       b75d8b21-9579-4653-8cf3-42a791ae0b55
:END:
#+TITLE: Globalization
#+CREATED: [2022-04-19 Tue 10:43]
#+LAST_MODIFIED: [2022-04-19 Tue 10:50]

- tags: [[id:5fecd21c-5701-48af-9fd8-a2a2ab9b36a8][Economics]]

Already present in the writings of Adam Smith and Ricardo, capital flowing freely between countries might be a problems for free markets.

#+begin_quote
By prefering the support of domestic to that of foreign industry, he intends only his own security; and by directing that industry in such a manner as its produce may be of the greatest value, he intends only his own gain, and he is, in this, as in many other cases, led by an invisible hand to promote and end which was no part of his intention.
-- Adam Smith. The Wealth of Nation.
#+end_quote


* Reference

- Michael Pettis. "Trade wars are class wars"
- Oren Cass. [[https://americancompass.org/essays/searching-for-capitalism-in-the-wreckage-of-globalization/]["Searching for Capitalism in the Wreckage of Gloablization"]]
- Adam Smith. The Wealth of Nation.
