20220419104330-globalization.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-02 Thu 11:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Globalization</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Globalization</h1>
<ul class="org-ul">
<li>tags: <a href="20220103161656-economics.html#ID-5fecd21c-5701-48af-9fd8-a2a2ab9b36a8">Economics</a></li>
</ul>

<p>
Already present in the writings of Adam Smith and Ricardo, capital flowing freely between countries might be a problems for free markets.
</p>

<blockquote>
<p>
By prefering the support of domestic to that of foreign industry, he intends only his own security; and by directing that industry in such a manner as its produce may be of the greatest value, he intends only his own gain, and he is, in this, as in many other cases, led by an invisible hand to promote and end which was no part of his intention.
&#x2013; Adam Smith. The Wealth of Nation.
</p>
</blockquote>


<div id="outline-container-org591465f" class="outline-2">
<h2 id="org591465f">Reference</h2>
<div class="outline-text-2" id="text-org591465f">
<ul class="org-ul">
<li>Michael Pettis. "Trade wars are class wars"</li>
<li>Oren Cass. <a target='_blank' rel='noopener noreferrer' class='external' href="https://americancompass.org/essays/searching-for-capitalism-in-the-wreckage-of-globalization/">"Searching for Capitalism in the Wreckage of Gloablization"</a></li>
<li>Adam Smith. The Wealth of Nation.</li>
</ul>
</div>
</div>

<div id="outline-container-org1fd786f" class="outline-2">
<h2 id="org1fd786f">Links to this note</h2>
</div>
</div>
</body>
</html>